{
  "question_1": "What is the fuel consumption of the 911 Carrera GTS under WLTP standards?",
  "question_2": "How does the T-Hybrid system improve the performance of the 911 Carrera GTS?",
  "question_3": "What are the main features of the 911 Carrera's newly designed cockpit?",
  "question_4": "What is the top speed of the new 911 Carrera GTS?",
  "question_5": "How does the chassis of the 911 Carrera GTS enhance driving dynamics?",
  "question_6": "What unique feature is introduced in the lighting system of the new 911?",
  "question_7": "What is the engine capacity of the 911 Carrera?",
  "question_8": "What are the available customization options for the new 911?",
  "question_9": "What is the system output of the new 911 Carrera GTS hybrid engine?",
  "question_10": "How has the 911 Carrera been redesigned to improve aerodynamics?",
  "question_11": "What is the acceleration time for the 911 Carrera with the Sport Chrono package?",
  "question_12": "What are the benefits of the lightweight lithium-ion battery in the 911 Carrera GTS?",
  "question_13": "What is the purpose of the adaptive front diffusers in the new 911?",
  "question_14": "What role does the eTurbo system play in the 911 Carrera GTS?",
  "question_15": "What are the connectivity features of the new Porsche Communication Management system?",
  "question_16": "How does the 911 Carrera GTS achieve reduced CO2 emissions compared to previous models?",
  "question_17": "What improvements have been made to the suspension system in the new 911 Carrera GTS?",
  "question_18": "How is the high-voltage system integrated into the 911 Carrera GTS chassis?",
  "question_19": "What is the significance of the new digital instrument cluster in the 911?",
  "question_20": "What tire configurations are standard for the new 911 Carrera GTS?",
  "question_21": "What makes the 718 Spyder RS unique compared to other models?",
  "question_22": "What is the acceleration time of the 718 Spyder RS?",
  "question_23": "How does the aerodynamics of the 718 Spyder RS improve performance?",
  "question_24": "What is the fuel consumption of the 718 Spyder RS under WLTP standards?",
  "question_25": "What is the top speed of the 718 Spyder RS?",
  "question_26": "How is the lightweight design achieved in the 718 Spyder RS?",
  "question_27": "What type of engine powers the 718 Spyder RS?",
  "question_28": "What are the key features of the 718 Spyder RS interior?",
  "question_29": "What is the function of the Porsche Torque Vectoring in the 718 Spyder RS?",
  "question_30": "What is the purpose of the NACA ducts on the 718 Spyder RS?",
  "question_31": "What are the benefits of the short-ratio seven-speed PDK transmission in the 718 Spyder RS?",
  "question_32": "How does the soft-top design of the 718 Spyder RS enhance its usability?",
  "question_33": "What is the weight difference between the 718 Spyder RS and the 718 Spyder with PDK?",
  "question_34": "What customization options are available for the 718 Spyder RS Weissach Package?",
  "question_35": "What are the standard features of the Porsche Communication Management in the 718 Spyder RS?",
  "question_36": "How does the lift system improve the practicality of the 718 Spyder RS?",
  "question_37": "What makes the Chronograph 718 Spyder RS exclusive?",
  "question_38": "What suspension adjustments can be made on the 718 Spyder RS?",
  "question_39": "What safety features are integrated into the 718 Spyder RS chassis?",
  "question_40": "What colors are available for the 718 Spyder RS exterior?",
  "question_41": "What is the engine power of the 911 GT2 RS?",
  "question_42": "How does the 911 Carrera improve aerodynamics compared to older models?",
  "question_43": "What makes the hybrid system in the new 911 unique?",
  "question_44": "What is the top speed of the 911 Carrera 4S?",
  "question_45": "What are the key benefits of the Weissach package for the 911 GT2 RS?",
  "question_46": "How does the front axle lift system benefit the 911 Carrera S?",
  "question_47": "What is the function of Porsche Active Suspension Management in the 911 models?",
  "question_48": "What are the main safety features in the 911 Carrera?",
  "question_49": "How does the 911 Carrera S improve fuel efficiency?",
  "question_50": "What customization options are available for the interior of the 911 Carrera?",
  "question_51": "What is the history of turbocharging in the 911 series?",
  "question_52": "How does the dual-clutch transmission in the 911 enhance performance?",
  "question_53": "What role does the Wet driving mode play in the 911's handling?",
  "question_54": "What are the dimensions of the wheels on the 911 Carrera S?",
  "question_55": "What is the acceleration time for the 911 GT2 RS?",
  "question_56": "What are the features of the Porsche Communication Management system in the 911?",
  "question_57": "How does the dynamic engine mount system improve handling in the 911 Carrera models?",
  "question_58": "What improvements have been made to the 911 Carrera's exhaust system?",
  "question_59": "What are the primary differences between the 911 Carrera and Carrera S models?",
  "question_60": "What materials are used in the lightweight construction of the 911 GT2 RS?",
  "question_61": "What is the function of the rear axle steering in the 911 Carrera?",
  "question_62": "How does the Sport Chrono Package enhance the driving experience of the 911?",
  "question_63": "What type of braking system is equipped in the 911 Carrera S?",
  "question_64": "What makes the 911 Turbo's VTG technology unique?",
  "question_65": "How is the air cooling system in the 911 GT2 RS different from earlier models?",
  "question_66": "What are the standout design features of the 911's LED headlights?",
  "question_67": "How does the 911 Carrera balance sportiness and everyday usability?",
  "question_68": "What is the significance of the 911's 2+2 seating configuration?",
  "question_69": "What are the environmental advancements in the new 911 engines?",
  "question_70": "What improvements have been made to the suspension in the 911 Carrera S?",
  "question_71": "What is the history of the dual-clutch transmission in the 911 series?",
  "question_72": "What customization options are available for the 911's exterior paint?",
  "question_73": "How does the 911 Carrera S perform on the Nürburgring Nordschleife?",
  "question_74": "What is the role of adaptive cruise control in the 911 Carrera?",
  "question_75": "What are the benefits of the eight-speed dual-clutch transmission in the 911?",
  "question_76": "What kind of sound system is included in the 911 Carrera S?",
  "question_77": "How does the 911 GT2 RS handle on the race track?",
  "question_78": "What new safety features have been added to the 911 series?",
  "question_79": "What are the standard features in the 911 Carrera's infotainment system?",
  "question_80": "What are the differences in wheel size between the front and rear axles of the 911 Carrera?",
  "question_81": "How does the rear spoiler in the 911 Carrera S improve performance?",
  "question_82": "What is the fuel consumption of the 911 Carrera S under WLTP standards?",
  "question_83": "What are the key highlights of the Porsche Torque Vectoring system?",
  "question_84": "What is the significance of the Sport Response button in the 911 Carrera?",
  "question_85": "What materials are used in the 911 GT2 RS's exhaust system?",
  "question_86": "What is the function of the electrically controlled wastegate valves in the 911 Carrera engines?",
  "question_87": "How does the Wet mode assist drivers in challenging conditions?",
  "question_88": "What are the weight reduction techniques used in the 911 GT2 RS?",
  "question_89": "What kind of driving data can be recorded with the Porsche Track Precision app?",
  "question_90": "What makes the 911 Carrera's braking system stand out?",
  "question_91": "What are the benefits of the mixed tyre configuration in the 911 models?",
  "question_92": "What distinguishes the design of the 911 Carrera's rear taillights?",
  "question_93": "How does the 911 GT2 RS achieve its top speed?",
  "question_94": "What are the interior material options available for the 911 Carrera?",
  "question_95": "What role does the rear axle play in the Carrera 4S's all-wheel-drive system?",
  "question_96": "How does the high-resolution touchscreen enhance the 911's infotainment?",
  "question_97": "What is the CO2 emission level of the 911 Carrera 4S?",
  "question_98": "What are the benefits of the titanium components in the 911 GT2 RS?",
  "question_99": "How is the power distributed in the 911 Carrera 4 models?",
  "question_100": "What enhancements have been made to the 911's aerodynamics?",
  "question_101": "How does the 911 Carrera S handle on uneven terrain?",
  "question_102": "What new lighting features are introduced in the 911 models?",
  "question_103": "What is the function of the exhaust flaps in the 911 Carrera S?",
  "question_104": "What driving modes are available in the 911 Carrera?",
  "question_105": "What are the differences between the 911 GT2 RS and earlier 911 models?",
  "question_106": "How does the Weissach package improve the performance of the 911 GT2 RS?",
  "question_107": "What is the purpose of the Piezo injectors in the 911 Carrera engines?",
  "question_108": "What makes the 911's chassis technology innovative?",
  "question_109": "What is the function of the dynamic engine mounts in the 911 Carrera?",
  "question_110": "What is the acceleration capability of the 911 Carrera S with Launch Control?",
  "question_111": "What are the advantages of the rear lid grille design in the 911 Carrera?",
  "question_112": "What are the standout features of the Night Vision Assist in the 911 Carrera?",
  "question_113": "How does the central rev counter contribute to the 911 driving experience?",
  "question_114": "What makes the LED Matrix Design headlights unique in the 911 models?",
  "question_115": "What are the available personalization options for the 911 Carrera?",
  "question_116": "What improvements have been made to the rear suspension in the 911 GT2 RS?",
  "question_117": "What are the unique attributes of the Carrera S's interior design?",
  "question_118": "How does the 911 Carrera S manage high-speed stability?",
  "question_119": "What materials contribute to the lightweight construction of the 911 models?",
  "question_120": "What improvements have been made to the 911 Carrera's steering system?",
  "question_121": "What is the acceleration time for the 718 Cayman GT4 RS with PDK transmission?",
  "question_122": "What are the differences between the 718 Cayman GT4 and the GT4 RS?",
  "question_123": "What makes the Taycan Turbo S a standout in the electric sports car category?",
  "question_124": "What are the features of the Weissach package for the 911 GT3?",
  "question_125": "How does the all-wheel-drive system in the 911 Carrera enhance performance?",
  "question_126": "What are the customization options available for the 718 Boxster?",
  "question_127": "What is the purpose of the GT brake system in the 718 Spyder?",
  "question_128": "How does the adaptive sports suspension in the 911 improve handling?",
  "question_129": "What is the fuel efficiency of the Panamera E-Hybrid in combined WLTP tests?",
  "question_130": "What role does the 800V architecture play in the Taycan’s performance?",
  "question_131": "What is the top speed of the Cayenne Turbo GT?",
  "question_132": "What makes the Porsche Tequipment products unique for vehicle customization?",
  "question_133": "How does the dual-motor setup in the Taycan improve its driving dynamics?",
  "question_134": "What is the significance of the two luggage compartments in the 718 models?",
  "question_135": "What distinguishes the 911 Turbo S from the standard 911 Turbo?",
  "question_136": "What are the available color options for the Macan GTS?",
  "question_137": "How does the rear-axle steering feature benefit the 911 GT3?",
  "question_138": "What safety features are standard in the Cayenne models?",
  "question_139": "What is the combined CO₂ emission of the 718 Cayman GTS 4.0 under WLTP?",
  "question_140": "What is the maximum recuperation power in the Taycan GTS?",
  "question_141": "How does the lightweight construction impact the 911 GT3’s performance?",
  "question_142": "What is the purpose of the CFRP rear wing in the 718 Cayman GT4 RS?",
  "question_143": "What are the advantages of the Sport Chrono Package in the Panamera models?",
  "question_144": "How does the hybrid drive system in the Cayenne E-Hybrid work?",
  "question_145": "What are the standout design features of the 911 Targa?",
  "question_146": "What makes the Macan S suitable for everyday use?",
  "question_147": "What is the range of the Taycan Turbo S under city driving conditions?",
  "question_148": "What features are included in the Heritage Design package for the 911 models?",
  "question_149": "How does the Tiptronic S transmission differ from the PDK in the Cayenne?",
  "question_150": "What is the acceleration time for the Panamera Turbo S E-Hybrid?",
  "question_151": "What improvements have been made to the infotainment system in the 911 models?",
  "question_152": "What customization options are available for the Cayenne Coupe?",
  "question_153": "What materials are used in the construction of the Taycan's body?",
  "question_154": "What is the seating configuration in the Panamera Sport Turismo?",
  "question_155": "What role does the lightweight convertible top play in the 718 Spyder?",
  "question_156": "What are the differences in acceleration between the Macan GTS and Macan S?",
  "question_157": "What is the significance of the eTurbo system in the 911 Turbo models?",
  "question_158": "How does the Porsche Car Configurator assist in personalizing a car?",
  "question_159": "What is the maximum range of the Taycan 4S Sport Turismo under WLTP?",
  "question_160": "What makes the Panamera GTS distinct from other Panamera models?",
  "question_161": "What type of battery technology is used in the Taycan series?",
  "question_162": "What enhancements are offered by the Exclusive Manufaktur for the Macan?",
  "question_163": "What is the luggage capacity in the Cayenne E-Hybrid?",
  "question_164": "How does the Porsche Electric Sport Sound enhance the Taycan driving experience?",
  "question_165": "What are the available wheel designs for the 718 Cayman models?",
  "question_166": "What is the history of the 911 Carrera's design evolution?",
  "question_167": "What new features are introduced in the 911 Carrera S?",
  "question_168": "What are the environmental considerations in the Taycan’s battery design?",
  "question_169": "What is the role of the air curtains in the 911 Turbo’s aerodynamics?",
  "question_170": "What is the power output of the Cayenne Turbo S E-Hybrid?",
  "question_171": "What makes the Taycan Cross Turismo suitable for off-road conditions?",
  "question_172": "What is the purpose of the rear wing on the 911 GT3 with Touring Package?",
  "question_173": "What is the top speed of the Panamera Turbo S Executive?",
  "question_174": "What customization options are offered for the Taycan GTS Sport Turismo?",
  "question_175": "How does the dual-zone climate control system work in the Cayenne?",
  "question_176": "What distinguishes the 718 Spyder from other 718 models?",
  "question_177": "What is the battery charging time for the Taycan Turbo with a fast charger?",
  "question_178": "What are the key features of the Porsche Torque Vectoring system in the 911 models?",
  "question_179": "What are the color options for the Panamera GTS interior?",
  "question_180": "What innovations are introduced in the latest Macan models?",
  "question_181": "What is the acceleration time of the 718 Cayman GT4 RS with PDK?",
  "question_182": "How does the Taycan's 800V architecture improve charging efficiency?",
  "question_183": "What makes the Macan GTS different from other Macan models?",
  "question_184": "What are the performance capabilities of the 911 Turbo S?",
  "question_185": "How does the Panamera combine luxury and sportiness?",
  "question_186": "What is unique about the rear-wheel drive in the 718 models?",
  "question_187": "What customization options are available for the 911 Carrera?",
  "question_188": "How does the Cayenne E-Hybrid maximize fuel efficiency?",
  "question_189": "What are the benefits of the lightweight construction in the 911 GT3?",
  "question_190": "What makes the 718 Spyder’s convertible top unique?",
  "question_191": "What safety features are integrated into the Taycan’s design?",
  "question_192": "How does the adaptive GT suspension enhance the 718 Cayman GT4?",
  "question_193": "What is the top speed of the 911 Carrera GTS?",
  "question_194": "What makes the Weissach package for the 718 Cayman GT4 RS special?",
  "question_195": "What are the features of the Sport Chrono Package available for the Cayenne?",
  "question_196": "What differentiates the 911 Targa from other 911 models?",
  "question_197": "How does the Taycan GTS compare to the Taycan Turbo in performance?",
  "question_198": "What are the environmental benefits of the Panamera E-Hybrid?",
  "question_199": "How does the Cayenne Turbo GT deliver high performance?",
  "question_200": "What materials are used for the 911 GT3's rigid rear wing?",
  "question_201": "How does the Macan handle off-road conditions?",
  "question_202": "What are the benefits of the two luggage compartments in the 718 models?",
  "question_203": "What is the function of the GT brake system in the 718 Cayman GT4 RS?",
  "question_204": "What makes the LED headlights on the 911 Carrera unique?",
  "question_205": "What is the range of the Taycan Turbo S under WLTP standards?",
  "question_206": "How does the Panamera Turbo S differ from the Panamera GTS?",
  "question_207": "What are the unique features of the Macan’s interior?",
  "question_208": "How does the all-wheel-drive system in the Cayenne enhance handling?",
  "question_209": "What is the acceleration capability of the 911 Carrera S with the Sport Chrono Package?",
  "question_210": "What distinguishes the Carrera 4 models from the Carrera models?",
  "question_211": "What are the standard paint options for the 718 Spyder?",
  "question_212": "What role does the 8-speed Tiptronic S play in the Cayenne?",
  "question_213": "What is the purpose of the Porsche Electric Sport Sound in the Taycan?",
  "question_214": "What makes the Taycan Cross Turismo suitable for long journeys?",
  "question_215": "How does the Macan GTS achieve superior acceleration?",
  "question_216": "What upgrades are included in the GTS trim for the Panamera?",
  "question_217": "What type of engine powers the 911 Turbo S?",
  "question_218": "How does the mid-engine concept enhance the 718 models' agility?",
  "question_219": "What are the standout features of the 911 GT3's race track chassis?",
  "question_220": "What charging options are available for the Taycan models?",
  "question_221": "What are the wheel size options for the 911 Turbo models?",
  "question_222": "How does the adaptive air suspension improve the Cayenne’s ride quality?",
  "question_223": "What makes the Targa 4 GTS distinct from other Targa models?",
  "question_224": "How is the Cayenne’s hybrid system designed for optimal performance?",
  "question_225": "What are the differences in driving dynamics between the 718 Boxster and Cayman?",
  "question_226": "What is the purpose of the carbon-ceramic brakes in the 911 GT3 RS?",
  "question_227": "How does the Taycan manage energy recuperation during braking?",
  "question_228": "What are the customization options for the Panamera's interior?",
  "question_229": "What are the advantages of the dual-motor system in the Taycan?",
  "question_230": "What are the unique aerodynamic features of the 718 Cayman GT4 RS?",
  "question_231": "How does the Taycan Sport Turismo differ from the standard Taycan?",
  "question_232": "What improvements have been made to the 911 Carrera over previous generations?",
  "question_233": "What makes the Cayenne GTS suitable for high-speed driving?",
  "question_234": "What features enhance the off-road capability of the Macan?",
  "question_235": "What is the purpose of the rear axle steering in the 911 models?",
  "question_236": "How does the lightweight convertible top of the 718 Spyder impact performance?",
  "question_237": "What are the specifications of the Taycan Turbo Cross Turismo?",
  "question_238": "How does the Panamera Turbo S E-Hybrid maximize both power and efficiency?",
  "question_239": "What is the function of the Performance Battery Plus in the Taycan?",
  "question_240": "What are the new features in the latest Cayenne models?",
  "question_241": "What is the range of the Taycan Turbo S under WLTP standards?",
  "question_242": "How does the 718 Spyder’s lightweight convertible top improve its performance?",
  "question_243": "What are the customization options available for the 911 GT3 with the Touring Package?",
  "question_244": "How does the 800V architecture in the Taycan enhance its charging capabilities?",
  "question_245": "What are the key differences between the Cayenne Turbo and the Cayenne Turbo GT?",
  "question_246": "What makes the Macan GTS stand out in its performance compared to other Macan models?",
  "question_247": "How does the Panamera Turbo S E-Hybrid balance power and efficiency?",
  "question_248": "What unique features are included in the Weissach package for the 718 Cayman GT4 RS?",
  "question_249": "What is the acceleration time of the 911 Carrera 4 GTS with the Sport Chrono Package?",
  "question_250": "What are the standout features of the Taycan Cross Turismo for long-distance travel?"
}
